{"_id":{"$oid":"5cb9c8830f83455527160f59"},"created_at":{"$date":"2019-04-19T13:09:23.491Z"},"updated_at":{"$date":"2019-04-19T13:09:23.491Z"},"slug":"home","content":{"banner":{"title":"Step into a world of opportunities!"},"learn_more":{"title":"THE JOBS OF THE FUTURE","text":"Medipharm Solutions bridges the gap between the theory and the applied skills required in the workplace."},"admission":{"title":"DON'T PAY UNTIL YOU PLAY","text":"Our innovative income-sharing program means you may not have to pay tuition until after you've secured a decent job."},"about_us":{"title":"GUIDING PRINCIPLES","text":"\"The Medipharm Solutions\" is a blueprint for what we do and who we are."},"talk_us":{"title":"TAKE THE FIRST STEP","text":"Your journey starts with a single step. Will you step forward to transform your life?"},"experience":{"title":"Experience","text":"Medipharm Solutions graduates move on to outstanding careers in the Life Sciences, gaining employment among industry leaders, such as Bristol-Myers Squibb and Pfizer."},"graduates":{"title":"Our graduates go?","text":"Medipharm Solutions graduates move on to outstanding careers in the pharmaceutical and medical fields, gaining employment among industry leaders, such as Bristol- Myers Squibb and Pfizer. Our Career Development Office supports our students as they advance in their careers by providing counseling and advice on choosing the program best suited to their ambitions."}},"__v":0}
{"_id":{"$oid":"5cb9c8910f83455527160f5a"},"created_at":{"$date":"2019-04-19T13:09:37.670Z"},"updated_at":{"$date":"2019-04-19T13:09:37.670Z"},"slug":"footer","content":{"footer_about_us":{"text":"tronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing."},"footer_contact_us":{"address":"Medipharm Solutions, Unit 1850, 55 Parsonage Road, Edison, New Jersey 08837","phone":"1-877-290-6907","email":"info@medipharmsolutions.com"},"footer_newsletter":{"text":"Sign up for our weekly newsletter to learn more about how to break into or level up your career in the pharmaceutical or clinical research fields."},"footer_copyright":{"title":"2019 SOLLERSCOLLEGE. ALL RIGHTS RESERVED.","text":"All product names, logos, and brands are property of their respective owners. All company, product and service names used in this website are for identification purposes only. Use of these names, logos, and brands does not imply endorsement."}},"__v":0}
